# -*- encoding: utf-8 -*-
#----------------------------------------------------------------------------
# === クラス概要
# データ保持レコード
# === アクセサメソッド
#----------------------------------------------------------------------------
class StoreData
  # 入力レコード項目
  attr_accessor :first_key, :second_key, :name
  #---------------------------------------------------------------------------
  # === メソッド概要
  #  コンストラクタ
  # === 戻り値
  #---------------------------------------------------------------------------
  def initialize(hash={})
    @first_key  = hash[:first_key] 
    @second_key = hash[:second_key]
    @name       = hash[:name]
  end
end
